[
    {
        "title": "What Happens After You Die?",
        "verse": "And just as it is appointed for man to die once, and after that comes judgment,",
        "reference": "Hebrews 9:27",
        "explanation": "Everyone dies, and then we face God. It's important to think seriously about eternity."
    },
    {
        "title": "Do You Think You're a Good Person?",
        "verse": "There is a way that seems right to a man, but its end is the way to death.",
        "reference": "Proverbs 14:12",
        "explanation": "Many people think they're good, but we must compare ourselves to God's standard, not our own."
    },
    {
        "title": "The Mirror of God's Law",
        "verse": "Therefore no one will be declared righteous in God's sight by the works of the law; rather, through the law we become conscious of our sin.",
        "reference": "Romans 3:20",
        "explanation": "God's Law shows us we've sinned. It's like a mirror, revealing our true condition."
    },
    {
        "title": "Guilty of Breaking the Law",
        "verse": "For whoever keeps the whole law but fails in one point has become guilty of all of it.",
        "reference": "James 2:10",
        "explanation": "Even one sin makes us guilty before a holy God. We all need forgiveness."
    },
    {
        "title": "The Penalty of Sin",
        "verse": "For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.",
        "reference": "Romans 6:23",
        "explanation": "Sin earns us death, but God offers eternal life as a free gift through Jesus."
    },
    {
        "title": "God's Love for Sinners",
        "verse": "But God shows his love for us in that while we were still sinners, Christ died for us.",
        "reference": "Romans 5:8",
        "explanation": "God didn't wait for us to clean ourselves up. He loved us even in our sin."
    },
    {
        "title": "Confess and Believe",
        "verse": "If you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.",
        "reference": "Romans 10:9",
        "explanation": "We are saved not by works but by trusting in Jesus and declaring Him as Lord."
    },
    {
        "title": "Call on Jesus",
        "verse": "For everyone who calls on the name of the Lord will be saved.",
        "reference": "Romans 10:13",
        "explanation": "Anyone who calls on Jesus in repentance and faith will be saved."
    },
    {
        "title": "Repent and Turn to God",
        "verse": "Repent therefore, and turn back, that your sins may be blotted out.",
        "reference": "Acts 3:19",
        "explanation": "Repentance is turning away from sin and turning to God with all your heart."
    },
    {
        "title": "Saved by Grace, Not Works",
        "verse": "For by grace you have been saved through faith. And this is not your own doing; it is the gift of God.",
        "reference": "Ephesians 2:8",
        "explanation": "Salvation is a gift we receive through faith—not something we can earn."
    },
    {
        "title": "Your New Life Begins",
        "verse": "Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.",
        "reference": "2 Corinthians 5:17",
        "explanation": "Following Jesus means a changed heart and a new life with Him."
    },
    {
        "title": "Buried and Raised with Christ",
        "verse": "We were buried therefore with him by baptism into death, in order that, just as Christ was raised from the dead… we too might walk in newness of life.",
        "reference": "Romans 6:4",
        "explanation": "Baptism represents dying to sin and rising to a new life in Jesus."
    }
]